# -*- coding: utf-8 -*-


class Symbol:
    """
     - 2019 volume 10billion
     - 2015-2019 profit_rate > 10%
    """
    symbols = [
        '1568.T'    # [ ] ETF
        , '1802.T'  # [ ] 建設
        , '2503.T'  # [ ] 食品
        , '3038.T'  # [ ] 商社・卸
        , '3141.T'  # [ ] 小売
        , '8267.T'  # [ ] 小売
        , '9983.T'  # [ ] 小売
        , '3288.T'  # [x] 不動産
        , '4043.T'  # [ ] 素材・化学
        , '4911.T'  # [ ] 素材・化学
        , '4967.T'  # [ ] 素材・化学
        , '4523.T'  # [ ] 医薬品
        , '5411.T'  # [ ] 製鋼・非鉄
        , '5706.T'  # [ ] 製鋼・非鉄
        , '5713.T'  # [ ] 製鋼・非鉄
        , '2412.T'  # [ ] 情報通信サービス・その他
        , '2427.T'  # [ ] 情報通信サービス・その他
        , '6047.T'  # [ ] 情報通信サービス・その他
        , '7974.T'  # [ ] 情報通信サービス・その他
        , '8876.T'  # [ ] 情報通信サービス・その他
        , '9424.T'  # [ ] 情報通信サービス・その他
        , '9616.T'  # [ ] 譲歩通信サービス・その他
        , '6141.T'  # [ ] 機械
        , '6473.T'  # [ ] 機械
        , '6479.T'  # [ ] 電機・精密
        , '6619.T'  # [ ] 電機・精密
        , '6753.T'  # [ ] 電機・精密
        , '6762.T'  # [ ] 電機・精密
        , '6920.T'  # [ ] 電機・精密
        , '7717.T'  # [x] 電機・精密
        , '8306.T'  # [ ] 銀行
        , '9007.T'  # [ ] 運輸・物流
    ]
